https://www.ostechnix.com/create-list-installed-packages-install-later-list-arch-linux/

alsa-utils
arandr
autoconf
autojump
autokey
automake
autorandr
awesome
bash
betterlockscreen
binutils
bison
blueman
bluez-utils
broadcom-wl
bucklespring
bzip2
calc
calibre
chromium
cloc
code
codespell
compton
coreutils
cryptsetup
datagrip
datagrip-jre
device-mapper
dhcpcd
dialog
diffutils
discord
dmenu
docker
e2fsprogs
expac
fakeroot
feh
file
filesystem
findutils
firefox
flameshot
flex
gawk
gcc
gcc-libs
gdm
gettext
git
glibc
grep
gucharmap
gzip
htop
i3-gaps
i3blocks
i3status
imwheel
inetutils
inotify-tools
iproute2
iputils
jdk-openjdk
jfsutils
jsoncpp
kitty
lazydocker
less
libtool
licenses
linux
linux-firmware
logrotate
lvm2
m4
make
man-db
man-pages
mariadb
mdadm
mesa-vdpau
nano
nautilus
neofetch
netctl
networkmanager-openvpn
nmon
nodejs
notion-app
npm
ntfs-3g
openssh
openvpn
otf-fira-code
pacman
pacman-contrib
patch
pavucontrol
pciutils
peek
perl
pgadmin4
pikaur
pkgconf
playerctl
polybar
postgresql
postman-bin
procps-ng
psmisc
python
refind-efi
reflector
reiserfsprogs
rsync
s-nail
screen
scrot
sed
shadow
signal
simplescreenrecorder
slack-desktop
source-highlight
spotify
sshfs
steam
sudo
syncthing
syncthing-gtk
sysfsutils
systemd-sysvcompat
systemd-ui
tar
telegram-desktop-bin
termite
texinfo
the_silver_searcher
thefuck
thunderbird
tldr
tree
ttf-fantasque-sans-mono
ttf-font-awesome
ttf-font-awesome-4
ttf-hack
ttf-joypixels
ttf-liberation
ttf-material-design-icons-git
usbutils
util-linux
vi
vim
vlc
vulkan-radeon
which
wireless_tools
wpa_supplicant
wtf
xbindkeys
xf86-video-amdgpu
xfsprogs
xmlsec
xorg-server
xorg-xev
xorg-xfontsel
xorg-xinput
xorg-xprop
xorg-xrandr
xsel
yarn
zathura
zathura-pdf-mupdf
zoom
